Repository: eduguru/iSoko
Catalog: iSoko/Resources/Localizable.xcstrings
Source language: en
Languages: fr, rw, sw

# common.signup.option_individual_description
source: Perfect for sole proprietor, freelancers, and individual business owners managing their own operations
fr: Idéal pour les auto-entrepreneurs, les freelances et les propriétaires d'entreprises individuelles gérant leurs propres opérations
rw: Bikwiriye abikorera ku giti cyabo, abakora ubwabo, n'abafite ubucuruzi bwabo bwite
sw: Inafaa kwa wafanyabiashara binafsi, wafanyakazi huru, na wamiliki wa biashara za mtu mmoja wanaosimamia shughuli zao

# common.signup.option_individual_name
source: Individual Account
fr: Compte individuel
rw: Konti Bwite
sw: Akaunti Binafsi

# common.signup.option_organisation_description
source: Ideal for companies, partnerships, cooperatives, and organisations with multiple stakeholders
fr: Idéal pour les entreprises, les partenariats, les coopératives et les organisations avec plusieurs parties prenantes
rw: Ikwiye amasosiyete, ubufatanye, amakoperative, n'imiryango ifite abafatanyabikorwa benshi
sw: Inafaa kwa makampuni, ushirikiano, vyama vya ushirika, na mashirika yenye wadau wengi

# common.signup.option_organisation_name
source: Organisation Account
fr: Compte organisation
rw: Konti y'Itsinda
sw: Akaunti ya Shirika

# common.skip
source: Skip
fr: Passer
rw: Simbuka
sw: Ruka

# common.status.action_needed
source: Action needed
fr: Action requise
rw: Igikorwa Gisabwa
sw: Hatua Inahitajika

# common.status.all_good
source: All good
fr: Tout va bien
rw: Byose Biraryoha
sw: Kila kitu sawa

# common.status.in_stock
source: In Stock
fr: En stock
rw: Bihari
sw: Ipo Stokuni

# common.status.needs_attention
source: Needs attention
fr: Nécessite attention
rw: Bisaba Igitekerezo
sw: Inahitaji Makini

# common.status.on_track
source: On track
fr: En bonne voie
rw: Biragenda
sw: Ipo sawa

# common.status.out_of_stock
source: Out of Stock
fr: Rupture de stock
rw: Nta Bihari
sw: Haina Stoku

# common.success.done_button
source: Done
fr: Terminé
rw: Byarangiye
sw: Imekamilika

# common.success.share_button
source: Share
fr: Partager
rw: Sangira
sw: Shiriki

# common.success.title
source: Success
fr: Succès
rw: Byakunze
sw: Imefanikiwa

# common.verify_password_reset.confirm_button
source: Reset password
fr: Réinitialiser le mot de passe
rw: Hindura ijambo banga
sw: Weka upya nywila

# common.verify_password_reset.confirm_password_label
source: Confirm password
fr: Confirmer le mot de passe
rw: Emeza ijambo banga
sw: Thibitisha nywila

# common.verify_password_reset.header_description
source: Please type something you’ll remember
fr: Veuillez saisir quelque chose dont vous vous souviendrez
rw: Injiza ikintu uzibuka
sw: Tafadhali andika kitu utakachokumbuka

# common.verify_password_reset.header_title
source: Reset password
fr: Réinitialiser le mot de passe
rw: Hindura ijambo banga
sw: Weka upya nywila

# common.verify_password_reset.password_label
source: New password
fr: Nouveau mot de passe
rw: Ijambo banga rishya
sw: Nywila mpya

# common.verify_password_reset.password_length_error
source: Password must be 6–20 characters
fr: Le mot de passe doit contenir entre 6 et 20 caractères
rw: Ijambo banga rigomba kuba imyanya 6–20
sw: Nywila lazima iwe herufi 6–20

# common.verify_password_reset.password_placeholder
source: Enter password
fr: Saisir le mot de passe
rw: Injiza ijambo banga
sw: Weka nywila

# common.verify_password_reset.password_required_error
source: Password is required
fr: Le mot de passe est obligatoire
rw: Ijambo banga rirasabwa
sw: Nywila inahitajika

# home.featured_associations
source: Featured Associations
fr: Associations en vedette
rw: Amashyirahamwe Yatorewe
sw: Vyama Vilivyoangaziwa

# home.product_categories
source: Product Categories
fr: Catégories de produits
rw: Ibyiciro by'Ibicuruzwa
sw: Kategoria za Bidhaa

# home.service_categories
source: Service Categories
fr: Catégories de services
rw: Ibyiciro by'Serivisi
sw: Kategoria za Huduma

# home.top_deals
source: Top Deals
fr: Meilleures offres
rw: Amasezerano Meza
sw: Ofa Bora

# home.trending_products
source: Trending Products
fr: Produits tendance
rw: Ibicuruzwa Bikurikirwa
sw: Bidhaa Zinazopendwa

# home.trending_services
source: Trending Services
fr: Services tendance
rw: Serivisi Zikurikirwa
sw: Huduma Zinazopendwa

# insights.analytics
source: Analytics
fr: Analytique
rw: Isesengura
sw: Uchanganuzi

# insights.header_description
source: Resources and guides for your business
fr: Ressources et guides pour votre entreprise
rw: Inzego n'amabwiriza ku bucuruzi bwawe
sw: Rasilimali na miongozo ya biashara yako

# insights.header_title
source: Business Hub
fr: Hub Business
rw: Indangakazi y'Ubucuruzi
sw: Kitovu cha Biashara

# insights.latest_news
source: Latest Business News
fr: Dernières actualités commerciales
rw: Amakuru Mashya y'Ubucuruzi
sw: Habari za Hivi Karibuni za Biashara

# onboarding.page1.title
source: Africa trading Platform
fr: Plateforme de commerce africaine
rw: Urubuga rw’ubucuruzi rwa Afurika
sw: Jukwaa la biashara la Afrika

# onboarding.page1.description
source: Connecting and empowering entrepreneurs across the region by providing access to a vibrant marketplace and essential business tools.
fr: Connecter et autonomiser les entrepreneurs de la région grâce à un marché dynamique et des outils essentiels.
rw: Guhuza no kongerera ubushobozi ba rwiyemezamirimo mu karere binyuze ku isoko rikora neza n’ibikoresho by’ingenzi.
sw: Kuunganisha na kuwawezesha wajasiriamali kupitia soko lenye shughuli na zana muhimu za biashara.

# onboarding.page2.title
source: Buy & Sell
fr: Acheter et vendre
rw: Gura no kugurisha
sw: Nunua na uza

# onboarding.page2.description
source: Access a vibrant marketplace where you can buy quality products from trusted sellers or showcase your own goods and services to thousands of potential customers.
fr: Accédez à un marché dynamique où vous pouvez acheter des produits de qualité ou vendre vos propres biens.
rw: Kwinjira ku isoko rikomeye aho ushobora kugura cyangwa kugurisha ibicuruzwa byawe.
sw: Fikia soko lenye shughuli ambapo unaweza kununua au kuuza bidhaa zako.

# onboarding.page3.title
source: Expand Your Business
fr: Développez votre entreprise
rw: Kwagura ubucuruzi bwawe
sw: Panua biashara yako

# onboarding.page3.description
source: Get real-time market prices, use a currency converter, and a simple bookkeeping tool.
fr: Obtenez les prix du marché en temps réel et utilisez des outils de gestion simples.
rw: Bona ibiciro ku isoko mu gihe nyacyo kandi ukoreshe ibikoresho byo kubika ibitabo.
sw: Pata bei za soko kwa wakati halisi na tumia zana rahisi za uhasibu.

# onboarding.page4.title
source: Connect, Share & Grow
fr: Connecter, partager et grandir
rw: Guhuza, gusangira no gukura
sw: Unganisha, shiriki na ukue

# onboarding.page4.description
source: Join a trade association, participate in events and grow your network.
fr: Rejoignez une association et participez à des événements professionnels.
rw: Injira ishyirahamwe ry’ubucuruzi kandi witabire ibikorwa.
sw: Jiunge na chama cha biashara na shiriki matukio.

# home.categories.title
source: Product Categories
fr: Catégories de produits
rw: Ibyiciro by’ibicuruzwa
sw: Vikundi vya bidhaa

# home.services.title
source: Service Categories
fr: Catégories de services
rw: Ibyiciro bya serivisi
sw: Vikundi vya huduma

# home.trending_products.title
source: Trending Products
fr: Produits tendance
rw: Ibicuruzwa bikunzwe
sw: Bidhaa maarufu

# home.trending_services.title
source: Trending Services
fr: Services tendance
rw: Serivisi zikunzwe
sw: Huduma maarufu

# home.top_deals.title
source: Top Deals
fr: Meilleures offres
rw: Ibiciro byiza
sw: Ofa bora

# home.featured_associations.title
source: Featured Associations
fr: Associations en vedette
rw: Amashyirahamwe yatoranyijwe
sw: Vyama vilivyoangaziwa

# home.opportunities.title
source: Opportunities
fr: Opportunités
rw: Amahirwe
sw: Fursa

# common.analytics.title
source: Analytics
fr: Analyse
rw: Ibarurishamibare
sw: Uchambuzi

# common.analytics.description
source: View analytics for your business
fr: Voir les analyses de votre entreprise
rw: Reba ibarurishamibare ry’ubucuruzi bwawe
sw: Tazama uchambuzi wa biashara yako

# news.latest_business_news.title
source: Latest Business News
fr: Dernières nouvelles économiques
rw: Amakuru mashya y’ubucuruzi
sw: Habari mpya za biashara

# news.segment.public_news
source: Public News
fr: Nouvelles publiques
rw: Amakuru rusange
sw: Habari za umma

# news.segment.association_news
source: Association News
fr: Nouvelles des associations
rw: Amakuru y’amashyirahamwe
sw: Habari za vyama

# events.title
source: Events
fr: Événements
rw: Ibikorwa
sw: Matukio

# events.description
source: Trade Exhibitions and Events
fr: Expositions et événements commerciaux
rw: Imurikagurisha n’ibikorwa by’ubucuruzi
sw: Maonyesho na matukio ya biashara

# auth.login_required.title
source: Login required
fr: Connexion requise
rw: Kwinjira birasabwa
sw: Ingia inahitajika

# auth.login_required.message
source: Please login to continue, or continue as guest.
fr: Veuillez vous connecter ou continuer en tant qu’invité.
rw: Injira cyangwa ukomeze nk’umushyitsi.
sw: Ingia au endelea kama mgeni.

# auth.continue_as_guest
source: Continue as Guest
fr: Continuer en tant qu’invité
rw: Komeza nk’umushyitsi
sw: Endelea kama mgeni

# auth.login
source: Login
fr: Connexion
rw: Injira
sw: Ingia

# business.hub.products
source: Products
fr: Produits
rw: Ibicuruzwa
sw: Bidhaa

# business.hub.orders
source: Orders
fr: Commandes
rw: Ibicuruzwa byatanzwe
sw: Maagizo

# user.profile.verified
source: Verified
fr: Vérifié
rw: Byemejwe
sw: Imethibitishwa

# user.profile.not_verified
source: Not Verified
fr: Non vérifié
rw: Ntibyemejwe
sw: Haijathibitishwa

# user.profile.since
source: Since May 2026
fr: Depuis mai 2026
rw: Kuva Gicurasi 2026
sw: Tangu Mei 2026

# account.notifications.description
source: Manage your notifications
fr: Gérez vos notifications
rw: Gucunga imenyesha ryawe
sw: Dhibiti arifa zako

# account.trade_associations.title
source: Trade Associations
fr: Associations commerciales
rw: Amashyirahamwe y’ubucuruzi
sw: Vyama vya biashara

# account.trade_associations.description
source: Manage your associations
fr: Gérez vos associations
rw: Gucunga amashyirahamwe yawe
sw: Dhibiti vyama vyako

# account.orders.title
source: My Orders
fr: Mes commandes
rw: Ibicuruzwa byanjye
sw: Maagizo yangu

# account.orders.description
source: View your orders and wishlist
fr: Voir vos commandes et votre liste de souhaits
rw: Reba ibicuruzwa byawe n’ibyo wifuza
sw: Angalia maagizo na orodha ya matamanio

# settings.language.title
source: Language Settings
fr: Paramètres de langue
rw: Igenamiterere ry’ururimi
sw: Mipangilio ya lugha

# settings.language.description
source: Change your preferred language
fr: Changez votre langue préférée
rw: Hindura ururimi ukunda
sw: Badilisha lugha unayopendelea

# share.app.title
source: Share App
fr: Partager l’application
rw: Sangira porogaramu
sw: Shiriki app

# share.app.description
source: Invite friends and earn rewards
fr: Invitez des amis et gagnez des récompenses
rw: Tumira inshuti ubone ibihembo
sw: Alika marafiki upate zawadi

# account.logout
source: Log out
fr: Se déconnecter
rw: Sohoka
sw: Toka

# account.login_signup
source: Log in or sign up
fr: Se connecter ou s’inscrire
rw: Injira cyangwa wiyandikishe
sw: Ingia au jiandikishe

# common.more_view.help_support.description
source: Get assistance and support
fr: Obtenez de l’aide et du support
rw: Bona ubufasha n’inkunga
sw: Pata msaada na usaidizi

# faq.title
source: Frequently Asked Questions
fr: Questions fréquentes
rw: Ibibazo bikunze kubazwa
sw: Maswali yanayoulizwa mara kwa mara

# terms_and_conditions.title
source: Terms and Conditions
fr: Conditions générales
rw: Amategeko n’amabwiriza
sw: Sheria na Masharti

# tab.market.title
source: Market
fr: Marché
rw: Isoko
sw: Soko

# tab.business.title
source: Business
fr: Affaires
rw: Ubucuruzi
sw: Biashara

# tab.insight.title
source: Insight
fr: Analyse
rw: Inyunguruzo
sw: Uchambuzi

# tab.account.title
source: Account
fr: Compte
rw: Konti
sw: Akaunti

# common.label.date
source: Date
rw: Itariki
sw: Tarehe

# common.label.description
source: Description
rw: Ibisobanuro
sw: Maelezo

# common.label.description_notes
source: Description/Notes
rw: Ibisobanuro/Ibyanditswe
sw: Maelezo/Vidokezo

# common.label.stock
source: Stock
rw: Imbuto
sw: Stoku

# common.label.total
source: Total
rw: Igiteganyo
sw: Jumla

# common.label.transactions
source: Transactions
rw: Ibyakozwe
sw: Miamala

# common.more_view.notifications
source: Notifications
rw: Amatangazo
sw: Arifa

# business.hub.services
source: Services
rw: Serivisi
sw: Huduma

# account.notifications.title
source: Notifications
rw: Imenyesha
sw: Arifa

# tab.services.title
source: Services
rw: Serivisi
sw: Huduma
